2017-09-02-Maximize-the-org-capture-buffer.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-02 Sat 22:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Maximize the org-capture buffer</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matúš Goljer" />
<link rel="stylesheet" href="css/blog.css" />
</head>
<body>
<div id="preamble" class="status">

<div style="text-align: left; float: left;">
  <a href="./sitemap.html">Home</a>
  <a href="https://github.com/Fuco1/">GitHub</a>
  <a href="https://www.patreon.com/user?u=3282358">Patreon</a>
</div>
<div style="text-align: right;">
  <a href="https://fuco1.github.io/rss.xml">RSS</a>
  <a href="https://twitter.com/Fuco1337">Twitter</a>
</div>
<hr />
</div>
<div id="content">
<h1 class="title">Maximize the org-capture buffer</h1>

<p>
I'm a heavy user of <code>org-capture</code> and one behaviour of it always annoyed me:  instead of having the capture popup take the whole screen, it opens a new window.  This window is often small and somewhat inconvenient.  I like to do one thing at a time and so when I'm filing a note or capturing an idea I want to see only the capture buffer and no other distractions.  As we all know distractions kill flow and so we should always find ways to get all the nonsense out of the way.
</p>

<p>
Recently I've started using <a href="https://github.com/sprig/org-capture-extension">this awesome extension</a> to capture web content from firefox (works with chrome too).  I've tweaked the protocol handler to not only invoke <code>emacsclient "%u"</code> but also set some frame properties for later.
</p>

<p>
Here's the bash script I use as the handler
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #73d216;">#</span><span style="color: #73d216;">!/bin/</span><span style="color: #b4fa70;">bash</span>
emacsclient -c -F <span style="color: #e9b96e;">'((name . "org-protocol-capture"))'</span> <span style="color: #e9b96e;">"</span><span style="color: #eeeeec; background-color: #2e3436;">$</span><span style="color: #fcaf3e;">@</span><span style="color: #e9b96e;">"</span>
</pre>
</div>

<p>
The <code>-F</code> option sets the frame parameters with the specified alist.  Here I only set the name to <code>"org-protocol-capture"</code> I make sure to open new frame with <code>-c</code>.
</p>

<p>
Org capture provides several hooks we can use to tweak the default behaviour.
</p>

<p>
First, we make sure the capture buffer window takes the whole frame.  To do this, we first save the current window configuration and then delete all other windows on entering the <code>org-capture-mode</code>.  Unfortunately there is no "before anything happens" hook so we use a before advice instead.
</p>


<div class="org-src-container">
<pre class="src src-elisp" id="orgb1895ab"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">defvar</span> <span style="color: #fcaf3e;">my-org-capture-before-config</span> nil
  <span style="color: #e9b96e;">"Window configuration before `</span><span style="color: #e6a8df;">org-capture</span><span style="color: #e9b96e;">'."</span><span style="color: #888a85;">)</span>

<span style="color: #888a85;">(</span><span style="color: #b4fa70;">defadvice</span> <span style="color: #fce94f;">org-capture</span> <span style="color: #888a85;">(</span>before save-config activate<span style="color: #888a85;">)</span>
  <span style="color: #e9b96e;">"Save the window configuration before `</span><span style="color: #e6a8df;">org-capture</span><span style="color: #e9b96e;">'."</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">setq</span> my-org-capture-before-config <span style="color: #888a85;">(</span>current-window-configuration<span style="color: #888a85;">)))</span>

<span style="color: #888a85;">(</span>add-hook <span style="color: #e6a8df;">'org-capture-mode-hook</span> <span style="color: #e6a8df;">'delete-other-windows</span><span style="color: #888a85;">)</span>
</pre>
</div>

<p>
Next, after we finish the capture work flow (either with success or cancellation) we restore the window configuration saved previously.
</p>

<p>
Finally, let's make sure that after we refile the captured content the frame which was possibly created (if capture was invoked with <code>org-protocol</code>) closes itself automatically.  This keeps us in the flow and keeps the distraction of killing the frame manually away.  We use the frame name to decide if we wish to kill the frame or not (this is the <code>-F</code> argument from above).
</p>


<div class="org-src-container">
<pre class="src src-elisp" id="org1659a1e"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">my-org-capture-cleanup</span> <span style="color: #888a85;">()</span>
  <span style="color: #e9b96e;">"Clean up the frame created while capturing via org-protocol."</span>
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">In case we run capture from emacs itself and not an external app,</span>
  <span style="color: #73d216;">;; </span><span style="color: #73d216;">we want to restore the old window config</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">when</span> my-org-capture-before-config
    <span style="color: #888a85;">(</span>set-window-configuration my-org-capture-before-config<span style="color: #888a85;">))</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">-when-let</span> <span style="color: #888a85;">((</span><span style="color: #8cc4ff;">&amp;alist</span> <span style="color: #e6a8df;">'name</span> name<span style="color: #888a85;">)</span> <span style="color: #888a85;">(</span>frame-parameters<span style="color: #888a85;">))</span>
    <span style="color: #888a85;">(</span><span style="color: #b4fa70;">when</span> <span style="color: #888a85;">(</span>equal name <span style="color: #e9b96e;">"org-protocol-capture"</span><span style="color: #888a85;">)</span>
      <span style="color: #888a85;">(</span>delete-frame<span style="color: #888a85;">))))</span>

<span style="color: #888a85;">(</span>add-hook <span style="color: #e6a8df;">'org-capture-after-finalize-hook</span> <span style="color: #e6a8df;">'my-org-capture-cleanup</span><span style="color: #888a85;">)</span>
</pre>
</div>

<p>
With these tweaks the whole capture experience is much more streamlined for me.  When I invoke capture from anywhere (Emacs or via <code>org-protocol</code>), I get a full screen frame/window where I can quickly jot my thoughts.  After I'm finished everything restores itself to the previous state and I can continue with whatever task I was consumed prior to the capture process.
</p>
</div>
<div id="postamble" class="status">
<hr />
<div style="text-align: left; float: left;">Last updated at: 2017-09-02 22:07</div>
<div style="text-align: right;">Found a typo? <a href="https://github.com/Fuco1/fuco1.github.io/blob/master/posts/2017-09-02-Maximize-the-org-capture-buffer.org">Edit on GitHub!</a></div>
</div>
</body>
</html>
